{"class_name": "Functional", "config": {"name": "siamese_network", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 52], "dtype": "float32", "sparse": false, "ragged": false, "name": "left_input"}, "name": "left_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 52], "dtype": "float32", "sparse": false, "ragged": false, "name": "right_input"}, "name": "right_input", "inbound_nodes": []}, {"class_name": "Sequential", "config": {"name": "LSTM", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 52], "dtype": "float32", "sparse": false, "ragged": false, "name": "LSTM_1_input"}}, {"class_name": "LSTM", "config": {"name": "LSTM_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 20, 52], "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 50, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "LSTM_2", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 20, 52], "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 25, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 8}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 9}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 10}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}]}, "name": "LSTM", "inbound_nodes": [[["left_input", 0, 0, {}]], [["right_input", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "euclidean_distance", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAQAAAAHAAAAQwAAAHNEAAAAfABcAn0BfQJ0AGoBagJ0AGoBoAN8AXwCGACh\nAWQBZAJkA40DfQN0AGoBoAR0AGoBoAV8A3QAagZqB6AIoQChAqEBUwApBPruRmluZCB0aGUgRXVj\nbGlkZWFuIGRpc3RhbmNlIGJldHdlZW4gdHdvIHZlY3RvcnMuCgogICAgQXJndW1lbnRzOgogICAg\nICAgIHZlY3RzOiBMaXN0IGNvbnRhaW5pbmcgdHdvIHRlbnNvcnMgb2Ygc2FtZSBsZW5ndGguCgog\nICAgUmV0dXJuczoKICAgICAgICBUZW5zb3IgY29udGFpbmluZyBldWNsaWRlYW4gZGlzdGFuY2UK\nICAgICAgICAoYXMgZmxvYXRpbmcgcG9pbnQgdmFsdWUpIGJldHdlZW4gdmVjdG9ycy4KICAgIOkB\nAAAAVCkC2gRheGlz2ghrZWVwZGltcykJ2gJ0ZtoEbWF0aNoKcmVkdWNlX3N1bdoGc3F1YXJl2gRz\ncXJ02gdtYXhpbXVt2gVrZXJhc9oHYmFja2VuZNoHZXBzaWxvbikE2gV2ZWN0c9oBeNoBedoKc3Vt\nX3NxdWFyZakAchIAAAD6HzxpcHl0aG9uLWlucHV0LTE2LWY1MmZjNjI1M2VmMj7aEmV1Y2xpZGVh\nbl9kaXN0YW5jZYIAAABzBgAAAAALCAEeAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "euclidean_distance", "inbound_nodes": [[["LSTM", 1, 0, {}], ["LSTM", 2, 0, {}]]]}], "input_layers": [["left_input", 0, 0], ["right_input", 0, 0]], "output_layers": [["euclidean_distance", 0, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}